{
    "profile": {
        "title": "Perfil",
        "subtitle": "Conoce mi trayectoria como desarrollador, mis motivaciones y qué tipo de proyectos puedo construir",

        "about_me": "Sobre mí",
        "about_me_text": "Soy Santiago Barrera Muñoz, un desarrollador frontend apasionado con experiencia tanto como freelancer como en entornos corporativos. Resido en Medellín, Colombia, y completé mis estudios en Análisis y Desarrollo de Software en el SENA.\n\nMe especializo en la construcción de interfaces atractivas, funcionales y orientadas al usuario. Me motiva la constante evolución del desarrollo web y disfruto enfrentar nuevos desafíos que me permitan seguir creciendo profesional y técnicamente.",

        "why_develop": "¿Por qué y cómo aprendí a desarrollar?",
        "why_develop_text": "Aprendí a desarrollar impulsado por una profunda curiosidad y pasión por crear soluciones tecnológicas útiles. Al principio, el mundo del desarrollo parecía abrumador, pero descubrí que saber buscar y aprender era clave.\n\nDurante varios años de estudio y práctica constante, fui fortaleciendo mis habilidades a través de cursos, documentación, proyectos reales y trabajo profesional. Desde aplicaciones personales hasta soluciones para clientes reales, cada experiencia ha contribuido a mi formación como desarrollador comprometido y autodidacta.",

        "current_employment": "Situación laboral actual",
        "current_employment_text": "Actualmente me encuentro en búsqueda activa de nuevas oportunidades laborales donde pueda seguir creciendo como profesional, asumir nuevos retos y aportar con mis conocimientos y experiencia.\n\nEstoy abierto a roles en los que pueda trabajar en el desarrollo de productos útiles, aportar al equipo y seguir desarrollándome en un entorno dinámico e innovador.",

        "what_i_build": "¿Qué puedo construir?",
        "what_i_build_text": "Puedo desarrollar aplicaciones frontend completas, enfocadas en ofrecer experiencias visuales atractivas e intuitivas para el usuario. También tengo conocimientos en backend con Node.js y bases de datos como MySQL o MongoDB, lo cual me permite implementar funcionalidades clave como APIs, autenticación y manejo de datos."
    }
}
