{
    "projects": {
        "title": "Proyectos",
        "subtitle": "Proyectos personales destacados y experiencias que reflejan mi crecimiento como desarrollador",
        "elements": {
            "reviews": {
                "description": "Una destacada aplicación fullstack que destaco entre mis mejores logros. Explora un extenso catálogo de películas y series, incluyendo detalles como año de lanzamiento, directores, elenco y ganancias. Ofrezco un espacio para opiniones y reseñas, permitiéndote compartir tu pasión por películas como 'Pulp Fiction'. Todo respaldado por un sólido sistema de usuarios y sesiones para una experiencia interactiva."
            },
            "galleria": {
                "description": "Una aplicación inspirada en el sitio web de FrontendMentor. Explora una galería virtual para apreciar y conocer en profundidad las obras maestras más icónicas de la historia, incluyendo 'Mona Lisa', 'Noche Estrellada', 'Guernica', 'El Columpio' y más."
            },
            "devlinks": {
                "description": "Una aplicación desarrollada como parte del desafío 'Link-sharing app' de Frontend Mentor. Permite a los usuarios crear y personalizar perfiles con enlaces a sus plataformas favoritas. Incluye funcionalidades como carga de imágenes, validación de formularios, reordenamiento de enlaces mediante arrastrar y soltar, y vista previa en tiempo real del perfil. Esta aplicación full-stack ofrece una experiencia completa de gestión de enlaces."
            },
            "audiophile": {
                "description": "Este prototipo de comercio electrónico, también basado en el sitio web de FrontendMentor, presenta una interfaz atractiva donde puedes explorar los productos de una tienda de auriculares y altavoces. Experimenta la simulación de compra con un carrito de compras integrado."
            },
            "notetask": {
                "description": "Esta aplicación de notas combina funcionalidad y diseño, con una interfaz cuidada, animaciones fluidas y transiciones dinámicas. Ofrece modos claro y oscuro, selección de fuentes y una experiencia totalmente personalizada pensada para el uso diario."
            },
            "space": {
                "description": "Explora datos sobre una empresa ficticia de viajes espaciales: desde la duración del viaje hasta el destino, junto con el equipo que garantiza tu seguridad. ¡Reserva tus boletos y alcanza la luna!"
            },
            "password": {
                "description": "Genera contraseñas aleatorias con esta pequeña aplicación. Asegura tus cuentas con combinaciones seguras y únicas."
            },
            "countries": {
                "description": "Explora el mundo con Wiki Country, una app que te permite buscar y descubrir todos los países. Obtén información detallada de cualquier nación en un instante."
            },
            "sneakers": {
                "description": "Sumérgete en el mundo de las zapatillas con esta aplicación de prototipo de tienda. Experimenta la sensación de compra mientras exploras y seleccionas zapatos."
            },
            "jobs": {
                "description": "Explora empleos imaginarios con esta aplicación de listado laboral. Filtra trabajos por categoría y encuentra oportunidades que se ajusten a ti."
            },
            "yourNote": {
                "description": "Aplicación de notas, que permite a los usuarios gestionar y organizar sus apuntes de manera eficiente. Ofrece registro y autenticación de usuarios, una base de datos MySQL gestionada a través de Eloquent, y protección de rutas mediante middlewares. Esta aplicación demuestra mi habilidad para desarrollar soluciones prácticas y seguras utilizando tecnologías modernas."
            }
        }
    }
}