{
    "technologies": {
        "title": "Tecnologías",
        "subtitle": "Lista de tecnologías que utilizo a diario como desarrollador",
        "elements": {
            "react": {
                "first_title": "¿Qué puedo hacer con ",
                "first_content": "Con React, puedo crear interfaces de usuario interactivas y con gran capacidad de respuesta que se pueden integrar fácilmente con otras bibliotecas o marcos de JavaScript.",
                "second_title": "¿Qué he construido con ",
                "second_content": "Con react he creado múltiples aplicaciones web, entre las más destacadas están una aplicación para críticas de películas y series, un prototipo de ecommerce para auriculares, y una galería de arte",
                "third_title": "¿Por qué utilizo ",
                "third_content": "En general, React es una biblioteca potente y versátil que me ayuda a construir aplicaciones web eficientes, escalables y mantenibles. Sus principales cualidades son que es fácil de usar, tiene una amplia comunidad y también se integra fácilmente con otras herramientas.",
                "description": "ReactJS es una biblioteca JavaScript para crear interfaces de usuario interactivas en aplicaciones web. Se basa en componentes reutilizables y utiliza un enfoque de \"unidireccionalidad de datos\" para un manejo más eficiente de los cambios. Su uso del \"DOM virtual\" mejora el rendimiento al minimizar las actualizaciones directas en el DOM real. "
            },
            "javascript": {
                "first_title": "¿Qué puedo hacer con ",
                "first_content": "JavaScript es el lenguaje de programación que mejor utilizo para resolver problemas. El principal uso que le doy es crear sitios web interactivos y dinámicos.",
                "second_title": "¿Qué he construido con ",
                "second_content": "Además de los proyectos construidos con React, algunos proyectos interesantes construidos con esta tecnología han sido: un CRM de clientes, una página de aterrizaje para una ficticia compañía de viajes espaciales y un reloj.",
                "third_title": "¿Por qué utilizo ",
                "third_content": "La principal razón por la que uso JavaScript es su flexibilidad, la cual, a diferencia de otros lenguajes de programación, te permite desarrollar aplicaciones para diferentes plataformas.",
                "description": "JavaScript es un lenguaje de programación que se usa en sitios web para hacerlos interactivos y dinámicos. Permite agregar funciones como pop-ups, animaciones y validaciones en formularios, entre muchas otras cosas. Es el encargado de darle vida y hacer que las páginas web respondan a lo que haces."
            },
            "html": {
                "first_title": "¿Qué puedo hacer con ",
                "first_content": "HTML5 me permite crear estructuras web como encabezados, párrafos, listas, tablas, formularios y más para dar forma y estructura a tu contenido web.",
                "second_title": "¿Qué he construido con ",
                "second_content": "Debido a que HTML5 es el lenguaje de marcado estándar en los navegadores, todas las aplicaciones de front-end que he construido han utilizado esta tecnología. La que destaca más es la aplicación de reseñas de películas y series.",
                "third_title": "¿Por qué utilizo ",
                "third_content": "Uso HTML5 porque es el estándar web actual para crear páginas web y aplicaciones web. Esto significa que es ampliamente compatible con la mayoría de los navegadores web modernos y es la opción más segura y confiable para crear contenido web.",
                "description": "HTML5 es el lenguaje que se usa para construir la estructura de las páginas web. Define cómo se ven los textos, imágenes y enlaces, además de permitir la inclusión de videos y audio. Es el esqueleto que sostiene todo en su lugar y le da forma a Internet"
            },
            "css": {
                "first_title": "¿Qué puedo hacer con ",
                "first_content": "CSS es el lenguaje que utilizo para dar estilo y presentar mi página o aplicación web. Con CSS, controlo el diseño, estilo y apariencia de los elementos en mi sitio web, lo que me permite crear diseños atractivos, animaciones y efectos visuales.",
                "second_title": "¿Qué he construido con ",
                "second_content": "Debido a que CSS3 es el lenguaje de estilos estándar en los navegadores, cada aplicación de front-end que he construido ha utilizado esta tecnología. La que destaca más es la aplicación de reseñas de películas y series.",
                "third_title": "¿Por qué utilizo ",
                "third_content": "Con CSS3 tengo un control total de la presentación en mi sitio web, independientemente de la plataforma o el navegador. Además, es fácil de mantener y actualizar.",
                "description": "CSS3 es el pintor de una página web. Se encarga de darle estilo y colores a todo, desde el tamaño y fuente de las letras hasta el diseño de las imágenes y la disposición de los elementos. Es como la paleta mágica que hace que las páginas luzcan bonitas y atractivas."
            },
            "sass": {
                "first_title": "¿Qué puedo hacer con ",
                "first_content": "SASS (Syntactically Awesome Style Sheets) es un preprocesador de CSS que te permite escribir código CSS de manera más eficiente y rápida.",
                "second_title": "¿Qué he construido con ",
                "second_content": "SASS es la principal y favorita herramienta que utilizo para estilizar mis aplicaciones web. Llevo usando SASS durante 1 año, y desde ese momento he construido todas mis aplicaciones con esta tecnología.",
                "third_title": "¿Por qué utilizo ",
                "third_content": "Utilizo SASS en mi día a día porque, como preprocesador, me ayuda a ahorrar tiempo y reducir la repetición de código con variables, funciones y anidamiento de selectores. Además, un punto clave es su sistema de modularización y organización, que me permite mantener mi código organizado y fácil de entender, especialmente en proyectos grandes.",
                "description": "SASS es un asistente de estilización para CSS. Te permite escribir estilos de manera más organizada y reutilizable, con funciones y variables. Es un ayudante que agiliza el proceso de diseño en las páginas web.."
            },
            "nextjs": {
                "first_title": "¿Qué puedo hacer con ",
                "first_content": "NextJS es el marco de trabajo por excelencia para React. Me proporciona renderizado en el lado del servidor, generación de páginas estáticas, optimización de rendimiento e incluso integración con APIs externas.",
                "second_title": "¿Qué he construido con ",
                "second_content": "NextJS es la tecnología con la que trabajo más en la actualidad. De hecho, este portafolio está construido utilizando esta herramienta. Dos de mis proyectos principales han sido construidos en NextJS: la aplicación de reseñas de películas y series, y la galería de arte.",
                "third_title": "¿Por qué utilizo ",
                "third_content": "La necesidad de utilizar NextJS surge de la deficiencia de React para gestionar el SEO en un sitio web. Además, nos permite escribir código JavaScript y React en el servidor, lo que nos abre muchas puertas a la hora de desarrollar aplicaciones full stack.",
                "description": "NextJS es como un mejorador de ReactJS. Ayuda a construir aplicaciones web más rápidas y eficientes, con enrutamiento sencillo y renderización optimizada. Es como el motor que potencia React y hace que las páginas carguen más rápido."
            },
            "styledComponents": {
                "first_title": "¿Qué puedo hacer con ",
                "first_content": "Styled Components me permite definir estilos para mis componentes de React de una manera más intuitiva y dinámica, lo que facilita la lectura y el mantenimiento del código. También me permite crear temas personalizados y anidar estilos para crear estilos más complejos.",
                "second_title": "¿Qué he construido con ",
                "second_content": "Styled Components no es mi forma favorita de estilizar mis aplicaciones, pero aún así he construido aplicaciones pequeñas utilizando esta tecnología, como aplicaciones de clima, formularios, etc.",
                "third_title": "¿Por qué utilizo ",
                "third_content": "Styled Components es una forma rápida y declarativa de escribir estilos, que, aunque tiene algunas desventajas en comparación con otras herramientas, reduce considerablemente el tiempo de desarrollo.",
                "description": "Styled Components es una herramienta que permite escribir estilos directamente en tus componentes de React. Hace que el diseño sea más modular y fácil de mantener, al usar JavaScript para definir estilos."
            },
            "pug": {
                "first_title": "¿Qué puedo hacer con ",
                "first_content": "Esta herramienta te permite escribir código HTML de una manera elegante, concisa y legible. Con esta tecnología, tengo la capacidad de transformar código mantenible, reutilizable y legible de Pug a HTML estándar.",
                "second_title": "¿Qué he construido con ",
                "second_content": "Al comienzo de mi etapa de aprendizaje, Pug era la herramienta que utilizaba para escribir código HTML. Esto me llevó a crear varios proyectos interesantes con esta tecnología, como una wiki de países, una página de aterrizaje espacial, un prototipo de comercio electrónico de zapatos, entre otros.",
                "third_title": "¿Por qué utilizo ",
                "third_content": "Pug me proporciona una sintaxis simplificada de HTML estándar. Además, la reutilización de código y la eficiencia al escribir son factores que me llevaron a utilizar esta herramienta como una de mis favoritas.",
                "description": "Pug es un lenguaje que simplifica la escritura de HTML. Te permite crear estructuras de página más limpias y concisas, usando menos código que HTML convencional."
            },
            "figma": {
                "first_title": "¿Qué puedo hacer con ",
                "first_content": "Figma es una herramienta de diseño, generalmente utilizada para crear interfaces de usuario. Con ella puedo crear interfaces atractivas, que aunque no sean las más sofisticadas porque no soy diseñador, cumplen su función en el proceso de desarrollo de un producto.",
                "second_title": "¿Qué he construido con ",
                "second_content": "Con Figma he diseñado varias de mis propias aplicaciones, como mi primer portafolio, un gestor de clientes y mi favorita: una agencia inmobiliaria. Todo desde cero.",
                "third_title": "¿Por qué utilizo ",
                "third_content": "Figma es una herramienta de diseño en la nube, que me permite crear cualquier interfaz de usuario desde mi propio navegador. Además, es una herramienta de diseño completa, es decir, es posible crear la identidad de un producto completamente con Figma. Por último, comento que es la herramienta de diseño más cómoda y fácil de usar que he utilizado.",
                "description": "Figma es una herramienta de diseño que ayuda a crear y colaborar en diseños de interfaces de usuario y prototipos. Facilita la creación de diseños atractivos y permite a los equipos trabajar juntos en tiempo real."
            },
            "mysql": {
                "first_title": "¿Qué puedo hacer con ",
                "first_content": "MySQL es posiblemente el gestor de bases de datos más famoso del mundo. Con él, tengo la capacidad de modelar bases de datos desde cero, realizar consultas DDL y DML e incluso cambiar la lógica de la base de datos.",
                "second_title": "¿Qué he construido con ",
                "second_content": "Mi camino en el back-end no ha sido tan largo como en el front-end, pero aún así he creado y modelado algunas bases de datos, como un gestor para comprar y vender casas, un sistema de contactos y un gestor para una clínica veterinaria.",
                "third_title": "¿Por qué utilizo ",
                "third_content": "Utilizo este gestor de bases de datos porque, además de ser de código abierto y gratuito, su compatibilidad con casi todos los lenguajes de programación brinda libertad en el desarrollo. Asimismo, cabe mencionar que es una plataforma confiable debido a su gran comunidad y al tiempo que ha sido consolidado en el mercado.",
                "description": "MySQL es un sistema de gestión de bases de datos (DBMS) que almacena y organiza datos en sitios web. Se utiliza con PHP y otros lenguajes para gestionar la información de manera eficiente."
            },
            "php": {
                "first_title": "¿Qué puedo hacer con ",
                "first_content": "PHP es el único lenguaje de programación backend con el que tengo suficientes habilidades para construir sistemas decentes. Utilizando esta tecnología, tengo la capacidad de gestionar bases de datos, lo que me permite crear sistemas CRUD (crear, eliminar, actualizar, eliminar).",
                "second_title": "¿Qué he construido con ",
                "second_content": "Mi camino en el backend no ha sido tan largo como en el frontend, pero aún así he creado algunos sistemas básicos, como un gestor para comprar y vender casas o un sistema de contactos.",
                "third_title": "¿Por qué utilizo ",
                "third_content": "PHP es un lenguaje de programación de alto nivel. Esto significa que su curva de aprendizaje es baja en comparación con otros lenguajes de programación. Esta fue la razón principal por la que aprendí a utilizar PHP como lenguaje backend.",
                "description": "PHP es un lenguaje de programación utilizado para construir sitios web dinámicos. Puede generar contenido personalizado y trabajar con bases de datos para almacenar y recuperar información."
            },
            "firebase": {
                "first_title": "¿Qué puedo hacer con ",
                "first_content": "Firebase es una plataforma web y móvil que permite a los desarrolladores construir sistemas backend de manera rápida y sencilla. Con esta herramienta, tengo la capacidad de crear sistemas de sesión, gestionar usuarios, información y archivos.",
                "second_title": "¿Qué he construido con ",
                "second_content": "Con la ayuda de Firebase, he creado lo que considero mi mejor proyecto personal: una aplicación de reseñas de películas y series. En ella, he aprendido mucho sobre Firebase, su funcionamiento, sus limitaciones y, sobre todo, lo que se puede lograr utilizando esta tecnología.",
                "third_title": "¿Por qué utilizo ",
                "third_content": "Es una plataforma gratuita que ofrece una amplia variedad de servicios y herramientas útiles para el desarrollo móvil o web. También es fácil de usar y aprender, con una curva de aprendizaje más rápida que un lenguaje de programación backend. Aunque, obviamente, esto viene con limitaciones.",
                "description": "Firebase es una plataforma en la nube que ayuda a desarrolladores a construir aplicaciones web y móviles. Proporciona herramientas para autenticación, almacenamiento de datos en tiempo real y más."
            },
            "tailwind": {
                "first_title": "¿Qué puedo hacer con ",
                "first_content": "TailwindCSS es otra técnica o tecnología para dar estilo a páginas web. Con ella puedo crear estilos para el 100% de mi aplicación. Aunque no es mi opción favorita para crear estilos, siempre la considero si el proyecto no va a crecer mucho.",
                "second_title": "¿Qué he construido con ",
                "second_content": "Con la ayuda de esta herramienta, he creado varias aplicaciones básicas, como formularios, filtros, CRM, entre otros.",
                "third_title": "¿Por qué utilizo ",
                "third_content": "TailwindCSS es una tecnología que te brinda productividad y flexibilidad al escribir código CSS. Además, sus limitaciones facilitan la creación de diseños responsivos.",
                "description": "Tailwind es un marco de diseño de interfaz que simplifica la creación de diseños y estilos en sitios web. Ofrece clases predefinidas que facilitan el diseño rápido y adaptable."
            },
            "github": {
                "first_title": "¿Qué puedo hacer con ",
                "first_content": "GitHub es una plataforma en línea que se utiliza principalmente para alojar y gestionar proyectos de software. Generalmente utilizo la plataforma para gestionar mis propios proyectos y a veces la utilizo como documentación para ciertos proyectos.",
                "second_title": "¿Qué he construido con ",
                "second_content": "Con GitHub he gestionado cada uno de los proyectos que he subido a la web.",
                "third_title": "¿Por qué utilizo ",
                "third_content": "GitHub y su ecosistema es la herramienta más utilizada en la web para gestionar código, y esto no es en vano. Esta tecnología tiene múltiples funciones y servicios que me permiten como desarrollador cambiar versiones en mis proyectos, gestionar quién puede cambiar el contenido de mis archivos, entre otras cosas.",
                "description": "GitHub es una plataforma para gestionar y compartir código de programación. Permite a los desarrolladores colaborar en proyectos, rastrear cambios y mantener un historial de versiones."
            },
            "git": {
                "first_title": "¿Qué puedo hacer con ",
                "first_content": "Git es otra herramienta para gestionar proyectos, sus versiones y sus cambios. Esta herramienta es esencial para el desarrollo y posterior mantenimiento de cualquier aplicación. Dicho esto, comento que lo uso todos los días para crear nuevos proyectos, editar los ya creados y a veces eliminarlos.",
                "second_title": "¿Qué he construido con ",
                "second_content": "Con Git he gestionado cada uno de los proyectos que he subido a la web.",
                "third_title": "¿Por qué utilizo ",
                "third_content": "Git permite la colaboración en un proyecto entre múltiples desarrolladores. Esto es fundamental en el desarrollo de un producto. Además, su sistema de versiones me permite realizar un seguimiento de cualquier problema en cualquier momento.",
                "description": "Git es un sistema de control de versiones que rastrea y gestiona cambios en el código de programación. Facilita la colaboración, el seguimiento de historiales y la fusión de contribuciones en proyectos."
            },
            "npm": {
                "first_title": "¿Qué puedo hacer con ",
                "first_content": "NPM es un administrador de paquetes que me permite gestionarlos fácilmente en mi proyecto. Es una herramienta fundamental en el desarrollo web moderno.",
                "second_title": "¿Qué he construido con ",
                "second_content": "Desde mis primeros días aprendiendo React, he utilizado NPM de una forma u otra. Esto significa que todos los proyectos construidos en React utilizan NPM.",
                "third_title": "¿Por qué utilizo ",
                "third_content": "NPM es el administrador de paquetes estándar de Node.js para cualquier proyecto. Aunque existen alternativas, esta opción es la más estable, la que tiene más información y también la más utilizada.",
                "description": "Npm (Node Package Manager) es una herramienta que ayuda a los desarrolladores a gestionar las bibliotecas de software que su proyecto necesita. Permite instalar, actualizar y compartir componentes fácilmente."
            },
            "laravel": {
                "first_title": "¿Qué puedo hacer con ",
                "first_content": "Utilizo su arquitectura MVC (Modelo-Vista-Controlador) para desarrollar aplicaciones con una estructura organizada y mantenible. También puedo construir aplicaciones API REST, proporcionando endpoints para la comunicación con otras aplicaciones y servicios..",
                "second_title": "¿Qué he construido con ",
                "second_content": "Una de las aplicaciones más destacadas que he desarrollado con Laravel es una plataforma de notas. En esta aplicación, gestiono el registro y autenticación de usuarios, la base de datos (utilizando MySQL) con Eloquent como ORM, y aseguro las rutas mediante los middlewares que ofrece Laravel.",
                "third_title": "¿Por qué utilizo ",
                "third_content": "Su enfoque en la legibilidad del código y la automatización de tareas comunes me permite ser más productivo. Además, su comunidad activa y la abundancia de recursos significan que siempre hay soporte y nuevas oportunidades para aprender.",
                "description": "Laravel es un moderno framework de PHP. Destaca por su elegante sintaxis y su amplia gama de características que facilitan la creación de aplicaciones robustas y escalables. Ofrece una arquitectura MVC sólida, manejo sencillo de bases de datos, enrutamiento flexible y un sistema de autenticación completo."

            }
        }
    }
}