{
    "profile": {
        "title": "Profile",
        "subtitle": "Learn about my journey as a developer, what drives me, and the kind of projects I build",

        "about_me": "About Me",
        "about_me_text": "I'm Santiago Barrera Muñoz, a passionate frontend developer with experience both as a freelancer and in corporate environments. I live in Medellín, Colombia, and I completed my studies in Software Analysis and Development at SENA.\n\nI specialize in building attractive, functional, and user-oriented interfaces. I'm driven by the constant evolution of web development and enjoy taking on new challenges that help me grow professionally and technically.",

        "why_develop": "Why and how did I learn to code?",
        "why_develop_text": "I learned to code out of a deep curiosity and passion for creating useful technological solutions. At first, the development world felt overwhelming, but I discovered that being able to search and learn was essential.\n\nOver several years of consistent study and hands-on practice, I strengthened my skills through courses, documentation, real projects, and professional experience. From personal apps to real-world client solutions, each step has shaped me into a committed and self-taught developer.",

        "current_employment": "Current employment status",
        "current_employment_text": "I am currently actively looking for new opportunities that allow me to grow, face new challenges, and contribute with my skills and experience.\n\nI’m open to roles where I can participate in building meaningful products, contribute to a team, and continue learning in a dynamic and innovative environment.",

        "what_i_build": "What can I build?",
        "what_i_build_text": "I can develop complete frontend applications focused on delivering intuitive and visually appealing user experiences. I also have backend knowledge with Node.js and databases like MySQL or MongoDB, allowing me to implement key features such as APIs, authentication, and data handling."
    }
}
