{
    "projects": {
        "title": "Projects",
        "subtitle": "Highlighted personal projects and experiences that reflect my growth as a developer",
        "elements": {
            "reviews": {
                "description": "An outstanding fullstack application that stands out among my finest achievements. Explore an extensive catalog of movies and series, including details such as release year, directors, cast, and earnings. I provide a space for opinions and reviews, allowing you to share your passion for films like 'Pulp Fiction'. All supported by a robust user and session system for an interactive experience."
            },
            "galleria": {
                "description": "An application inspired by the FrontendMentor website. Explore a virtual gallery to appreciate and delve into the iconic masterpieces of history, including 'Mona Lisa,' 'Starry Night,' 'Guernica,' 'The Swing,' and more."
            },

            "devlinks": {
                "description": "An application developed as part of Frontend Mentor's 'Link-sharing app' challenge. It allows users to create and customize profiles with links to their favorite platforms. Features include image uploads, form validation, drag-and-drop link reordering, and real-time profile preview. This full-stack application provides a comprehensive link management experience."
            },
            "audiophile": {
                "description": "This e-commerce prototype, also derived from the FrontendMentor website, offers an appealing interface to explore products from a headphones and speakers store. Experience the buying simulation with an integrated shopping cart."
            },
            "notetask": {
                "description": "This note-taking app combines functionality with aesthetics, offering a refined UI enhanced by fluid animations and dynamic transitions. It includes light and dark themes, customizable fonts, and a fully personalized experience designed for intuitive daily use."
            },
            "space": {
                "description": "Discover insights about a fictional space travel company, from trip duration to destination, and the team ensuring your safe journey. Book your tickets now and reach for the moon!"
            },
            "password": {
                "description": "Create random passwords using this compact app. Secure your accounts with strong and unique combinations."
            },
            "countries": {
                "description": "Explore the world with Wiki Country, a small app that lets you search and discover every country. Get detailed information about any nation in an instant."
            },
            "sneakers": {
                "description": "Dive into the sneaker world with this shoe store prototype app. Experience the shopping feel as you browse and select shoes."
            },
            "jobs": {
                "description": "Explore imaginary jobs with this job listing app. Filter jobs by category and find opportunities that suit you."
            },
            "yourNote": {
                "description": "Note-taking application that allows users to manage and organize their notes efficiently. It provides user registration and authentication, a MySQL database managed through Eloquent, and route protection using middlewares. This application showcases my ability to develop practical and secure solutions using modern technologies.."
            }
        }
    }
}