{
    "technologies": {
        "title": "Technologies",
        "subtitle": "Amount of technologies that i use every day as developer",
        "elements": {
            "javascript": {
                "first_title": "What can I do with ",
                "first_content": "JavaScript is the programming language I’m most proficient with. I use it to build interactive, dynamic, and functional web applications, from simple animations to complex application logic.",
                "second_title": "What have I built with ",
                "second_content": "Beyond projects built with React and NextJS, I’ve used JavaScript in a customer CRM, a landing page for a fictional space travel company, a digital clock, and in essential features across various personal and professional applications.",
                "third_title": "Why I use ",
                "third_content": "I use JavaScript for its flexibility. It connects all layers of a web application and enables development for frontend, backend, and even mobile. Its massive ecosystem and community support make it an essential tool for modern development.",
                "description": "JavaScript is a core programming language for web development. It enables interactivity, dynamic behaviors, and advanced logic on websites. From smart forms to real-time interactions, JavaScript powers the functionality of modern web apps."
            },
            "react": {
                "first_title": "What can I do with ",
                "first_content": "With React, I can build interactive, dynamic, and reusable user interfaces, ideal for modern applications. Its flexibility allows easy integration with other libraries or frameworks to suit different kinds of projects.",
                "second_title": "What have I built with ",
                "second_content": "I have used React in both personal and professional projects. Personal highlights include a movie and series review app, a headphone ecommerce prototype, an art gallery, and a personal link manager. Professionally, I’ve worked on a crypto project as a freelancer and have contributed to internal company apps by maintaining and adding new features, such as an app for managing new employee onboarding.",
                "third_title": "Why I use ",
                "third_content": "React allows me to develop fast, scalable, and well-structured web applications. Its component-based architecture, vast ecosystem, and strong community support make it an essential tool for both personal and corporate frontend development.",
                "description": "ReactJS is a JavaScript library developed by Meta for building component-based user interfaces. It uses a unidirectional data flow and a virtual DOM to enhance performance by minimizing direct manipulation of the real DOM. React is widely adopted in frontend development due to its efficiency and modularity."
            },
            "html": {
                "first_title": "What can I do with ",
                "first_content": "HTML5 allows me to create web structures such as headings, paragraphs, lists, tables, forms, and more to shape and structure my web content.",
                "second_title": "What have I built with ",
                "second_content": "Since HTML5 is the standard markup language in browsers, all front-end applications I have built have used this technology. The most notable one is the movie and series review application.",
                "third_title": "Why I use ",
                "third_content": "I use HTML5 because it is the current web standard for creating web pages and web applications. This means it is widely compatible with most modern web browsers and is the safest and most reliable option for creating web content.",
                "description": "HTML stands for HyperText Markup Language. It is a standard markup language for web page creation. It allows the creation and structure of sections, paragraphs, and links using HTML elements (the building blocks of a web page) such as tags and attributes"
            },
            "nodejs": {
                "first_title": "What can I do with ",
                "first_content": "With Node.js, I can build efficient and scalable servers using JavaScript on the backend. It allows me to handle multiple simultaneous connections thanks to its asynchronous and event-driven architecture.",
                "second_title": "What have I built with ",
                "second_content": "With Node.js, I’ve developed well-structured RESTful APIs, implemented secure login systems, and created real-time functionalities using sockets. Some projects include a personal link generator app, a planning poker app, and the backend of a cosmetology system I developed as my university final project.",
                "third_title": "Why I use ",
                "third_content": "Node.js allows me to unify the development stack using JavaScript both on the frontend and backend. It’s fast, lightweight, and has a huge ecosystem. It's ideal for building modern, scalable applications efficiently.",
                "description": "Node.js is a runtime environment that lets you run JavaScript on the server side. It is built on Chrome's V8 engine and allows for fast and scalable application development due to its non-blocking I/O model. It is widely used to build web services, APIs, and real-time applications."
            },
            "express": {
                "first_title": "What can I do with ",
                "first_content": "With Express, I can build robust and flexible web servers quickly. It allows me to define routes, handle HTTP requests and responses easily, and organize backend code in a clean and modular way.",
                "second_title": "What have I built with ",
                "second_content": "I’ve used Express alongside Node.js to develop RESTful APIs, manage user sessions, and structure medium-sized backend projects with multiple modules. Examples include a cosmetology app, a real-time planning poker system, and a personal link generator tool.",
                "third_title": "Why I use ",
                "third_content": "Express provides a simple yet powerful way to build web servers and organize backend logic. It’s minimalist, extensible, and has a large community, making development and maintenance much easier.",
                "description": "Express.js is a minimal and flexible Node.js web application framework that provides a robust set of features for building web and API applications. It simplifies route handling, middleware integration, and works well with databases and external services."
            },
            "angular": {
                "first_title": "What can I do with ",
                "first_content": "With Angular, I can develop large-scale enterprise web applications with a solid and maintainable architecture. Its modular and component-based structure makes it easy to build and organize complex applications.",
                "second_title": "What have I built with ",
                "second_content": "I’ve worked professionally with Angular on internal corporate applications. I added features, performed maintenance, and contributed to systems like a planning poker tool and enterprise tools with billing processes or launchers for other internal platforms.",
                "third_title": "Why I use ",
                "third_content": "Angular provides a robust structure and built-in tools that make building complex applications easier. Its use of TypeScript, powerful CLI, and built-in best practices help ensure scalability and long-term maintainability.",
                "description": "Angular is a TypeScript-based web development framework created by Google. It enables the building of single-page applications (SPAs) using a component-based architecture, services, and dependency injection. It is ideal for enterprise-level applications thanks to its robustness and scalability."
            },
            "css": {
                "first_title": "What can I do with ",
                "first_content": "CSS is the language I use to style and present my web page or application. With CSS, I control the layout, style, and appearance of elements on my website, allowing me to create attractive designs, animations, and visual effects.",
                "second_title": "What have I built with ",
                "second_content": "Since CSS3 is the standard styling language in browsers, every front-end application I have built has used this technology. The most notable one is the movie and series review application.",
                "third_title": "Why I use ",
                "third_content": "With CSS3, I have full control over the presentation on my website, regardless of the platform or browser. Additionally, it is easy to maintain and update.",
                "description": "CSS3 is a web page's painter. It's responsible for adding style and colors to everything, from the size and font of letters to the layout of images and arrangement of elements. It's like the magical palette that makes pages look beautiful and appealing."
            },
            "sass": {
                "first_title": "What can I do with ",
                "first_content": "SASS (Syntactically Awesome Style Sheets) is a CSS preprocessor that allows you to write CSS code more efficiently and quickly.",
                "second_title": "What have I built with ",
                "second_content": "SASS is the primary and favorite tool I use for styling my web applications. I have been using SASS for 1 year, and since then, I have built all my applications using this technology.",
                "third_title": "Why I use ",
                "third_content": "I use SASS in my day-to-day work because, as a preprocessor, it helps me save time and reduce code repetition with variables, functions, and selector nesting. Additionally, a key point is its modularization and organization system, which allows me to keep my code organized and easy to understand, especially in large projects.",
                "description": "SASS is a styling assistant for CSS. It lets you write styles in a more organized and reusable way, with functions and variables. It's a helper that streamlines the design process on web pages."
            },
            "nextjs": {
                "first_title": "What can I do with ",
                "first_content": "NextJS is the go-to framework to power up React applications. It enables server-side rendering, static site generation, performance optimization, and API integration, all within a smooth development experience.",
                "second_title": "What have I built with ",
                "second_content": "NextJS is the technology I use most nowadays. I’ve built this portfolio, a movie and series review app, an art gallery, and a freelance crypto-related project using NextJS — all leveraging its fast rendering, performance optimization, and SEO benefits.",
                "third_title": "Why I use ",
                "third_content": "I use NextJS because it addresses React's SEO limitations and enhances performance. It also allows me to build fullstack applications using JavaScript and React on both the client and server, streamlining the development process.",
                "description": "NextJS is a framework built on top of React that boosts performance, simplifies routing, and enables server-side rendering. It’s perfect for building fast, SEO-friendly web applications with a great developer experience."
            },
            "styledComponents": {
                "first_title": "What can I do with ",
                "first_content": "Styled Components allows me to define styles for my React components in a more intuitive and dynamic way, making code reading and maintenance easier. It also enables me to create custom themes and nest styles to create more complex styles.",
                "second_title": "What have I built with ",
                "second_content": "Styled Components is not my favorite way to style my applications, but I have still built small applications using this technology, such as weather apps, forms, etc.",
                "third_title": "Why I use ",
                "third_content": "Styled Components is a fast and declarative way to write styles, which, although it has some disadvantages compared to other tools, significantly reduces development time.",
                "description": "Styled Components is a tool that lets you write styles directly in your React components. It makes design more modular and easier to maintain, using JavaScript to define styles."
            },
            "pug": {
                "first_title": "What can I do with ",
                "first_content": "This tool allows me to write HTML code in an elegant, concise, and readable way. With this technology, I have the ability to transform maintainable, reusable, and readable Pug code into standard HTML.",
                "second_title": "What have I built with ",
                "second_content": "At the beginning of my learning stage, Pug was the tool I used to write HTML code. This led me to create several interesting projects with this technology, such as a country wiki, a space landing page, a shoe e-commerce prototype, among others.",
                "third_title": "Why I use ",
                "third_content": "Pug provides me with a simplified syntax of standard HTML. Additionally, code reuse and efficiency in writing are factors that led me to use this tool as one of my favorites.",
                "description": "Pug is a language that simplifies writing HTML. It enables creating cleaner and more concise page structures, using less code than conventional HTML."
            },
            "figma": {
                "first_title": "What can I do with ",
                "first_content": "Figma is a design tool commonly used for creating user interfaces. With it, I can create attractive interfaces that, although they may not be the most sophisticated since I'm not a designer, serve their purpose in the product development process.",
                "second_title": "What have I built with ",
                "second_content": "With Figma, I have designed several of my own applications, such as my first portfolio, a customer management system, and my favorite: a real estate agency. All from scratch.",
                "third_title": "Why I use ",
                "third_content": "Figma is a cloud-based design tool that allows me to create any user interface from my own browser. Additionally, it is a comprehensive design tool, meaning it is possible to create a product's entire identity using Figma. Lastly, it is the most comfortable and user-friendly design tool I have used.",
                "description": "Figma is a design tool that helps create and collaborate on user interface designs and prototypes. It makes creating appealing designs easier and enables teams to work together in real-time."
            },
            "mysql": {
                "first_title": "What can I do with ",
                "first_content": "MySQL is possibly the most famous database management system in the world. With it, I have the ability to model databases from scratch, perform DDL and DML queries, and even change the logic of the database.",
                "second_title": "What have I built with ",
                "second_content": "My journey in the back-end hasn't been as long as in the front-end, but I have still created and modeled some databases, such as a manager for buying and selling houses, a contacts system, and a manager for a veterinary clinic.",
                "third_title": "Why I use ",
                "third_content": "I use this database management system because, in addition to being open source and free, its compatibility with almost all programming languages provides freedom in development. It is also worth mentioning that it is a reliable platform due to its large community and the time it has been consolidated in the market.",
                "description": "MySQL is a database management system that stores and organizes data on websites. It's used with PHP and other languages to manage information efficiently."
            },
            "php": {
                "first_title": "What can I do with ",
                "first_content": "PHP is the only back-end programming language in which I have enough skills to build decent systems. Using this technology, I have the ability to manage databases, allowing me to create CRUD (Create, Read, Update, Delete) systems.",
                "second_title": "What have I built with ",
                "second_content": "My journey in the back-end hasn't been as long as in the front-end, but I have still created some basic systems, such as a manager for buying and selling houses or a contacts system.",
                "third_title": "Why I use ",
                "third_content": "PHP is a high-level programming language. This means that its learning curve is low compared to other programming languages. This was the main reason why I learned to use PHP as a back-end language.",
                "description": "PHP is a programming language used to build dynamic websites. It can generate custom content and work with databases to store and retrieve information."
            },
            "firebase": {
                "first_title": "What can I do with ",
                "first_content": "Firebase is a web and mobile platform that allows developers to quickly and easily build back-end systems. With this tool, I have the ability to create session systems, manage users, information, and files.",
                "second_title": "What have I built with ",
                "second_content": "With the help of Firebase, I have created what I consider my best personal project: a movie and series review application. In it, I have learned a lot about Firebase, its functioning, its limitations, and above all, what can be achieved using this technology.",
                "third_title": "Why I use ",
                "third_content": "It is a free platform that offers a wide variety of services and useful tools for mobile or web development. It is also easy to use and learn, with a faster learning curve than a back-end programming language. Although, obviously, this comes with limitations.",
                "description": "Firebase is a cloud platform that assists developers in building web and mobile applications. It provides tools for authentication, real-time data storage, and more."
            },
            "typescript": {
                "first_title": "¿Qué puedo hacer con ",
                "first_content": "TypeScript me permite desarrollar aplicaciones web robustas, escalables y mantenibles. Gracias a su tipado estático, detecto errores antes de ejecutar el código y puedo trabajar con mayor confianza en proyectos grandes.",
                "second_title": "¿Qué he construido con ",
                "second_content": "He utilizado TypeScript en aplicaciones construidas con frameworks como React, NextJS y Angular. Con él desarrollé dashboards administrativos, formularios complejos con validaciones, y funcionalidades compartidas entre frontend y backend.",
                "third_title": "¿Por qué utilizo ",
                "third_content": "Uso TypeScript porque mejora la calidad del código JavaScript, facilita el trabajo en equipo y ayuda a prevenir errores comunes. Su integración con editores y su compatibilidad con JavaScript lo hacen una herramienta poderosa para cualquier proyecto moderno.",
                "description": "TypeScript es un superset de JavaScript que añade tipado estático y otras características avanzadas. Permite escribir código más seguro, claro y mantenible, ideal para el desarrollo profesional de aplicaciones modernas."
            },
            "github": {
                "first_title": "What can I do with ",
                "first_content": "GitHub is an online platform primarily used to host and manage software projects. I usually use the platform to manage my own projects and sometimes use it as documentation for certain projects.",
                "second_title": "What have I built with ",
                "second_content": "With GitHub, I have managed each of the projects I have uploaded to the web.",
                "third_title": "Why I use ",
                "third_content": "GitHub and its ecosystem are the most widely used tool on the web for managing code, and this is not in vain. This technology has multiple functions and services that allow me as a developer to change versions in my projects, manage who can change the content of my files, among other things.",
                "description": "GitHub is a platform for managing and sharing programming code. It enables developers to collaborate on projects, track changes, and maintain version history."
            },
            "git": {
                "first_title": "What can I do with ",
                "first_content": "Git is another tool for managing projects, their versions, and their changes. This tool is essential for the development and subsequent maintenance of any application. That being said, I use it every day to create new projects, edit the ones already created, and sometimes delete them.",
                "second_title": "What have I built with ",
                "second_content": "With Git, I have managed each of the projects I have uploaded to the web.",
                "third_title": "Why I use ",
                "third_content": "Git allows collaboration on a project among multiple developers. This is fundamental in the development of a product. In addition, its versioning system allows me to keep track of any issues at any time.",
                "description": "Git is a version control system that tracks and manages changes in programming code. It simplifies collaboration, history tracking, and merging contributions in projects."
            },
            "npm": {
                "first_title": "What can I do with ",
                "first_content": "NPM is a package manager that allows me to easily manage packages in my project. It is a fundamental tool in modern web development.",
                "second_title": "What have I built with ",
                "second_content": "Since my early days learning React, I have used NPM in one way or another. This means that all projects built in React use NPM.",
                "third_title": "Why I use ",
                "third_content": "NPM is the standard package manager for Node.js in any project. Although there are alternatives, this option is the most stable, the one with the most information, and also the most widely used.",
                "description": "Npm (Node Package Manager) is a tool that helps developers manage the software libraries their project needs. It allows easy installation, updating, and sharing of components."
            },
            "laravel": {
                "first_title": "What can I do with ",
                "first_content": "I use its MVC (Model-View-Controller) architecture to develop applications with an organized and maintainable structure. I can also build RESTful API applications, providing endpoints for communication with other applications and services.",
                "second_title": "What have I built with ",
                "second_content": "One of the standout applications I've built with Laravel is a note-taking platform. In this application, I manage user registration and authentication, the database (using MySQL) with Eloquent as the ORM, and secure routes using Laravel's provided middlewares..",
                "third_title": "Why I use ",
                "third_content": "Its focus on code readability and automation of common tasks allows me to be more productive. Plus, its active community and wealth of resources mean there's always support and new opportunities to learn.",
                "description": "Laravel is a modern PHP framework that stands out for its elegant syntax and wide range of features, making it easy to develop robust and scalable applications. It offers a solid MVC architecture, simple database management, flexible routing, and a comprehensive authentication system."
            }
        }
    }
}